; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v8 - type_1 ?v3 - type_3)
 	      (pred_2 ?v4 - object ?v3 - type_3)
	      (pred_4 ?v8 - type_1 ?v6 - type_2)
	      (pred_1 ?v8 - type_1 ?v4 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v8 - type_1 ?v2 ?v7 - type_3)
       :precondition (and  (pred_3 ?v8 ?v2))
       :effect (and  (pred_3 ?v8 ?v7)
		     (not (pred_3 ?v8 ?v2))))

   (:action op_1
       :parameters (?v8 - type_1 ?v5 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v1) (pred_3 ?v8 ?v1) (pred_4 ?v8 ?v6))
       :effect (and (pred_1 ?v8 ?v5 ?v6)
		    (not (pred_2 ?v5 ?v1)) 
		    (not (pred_4 ?v8 ?v6))))

   (:action op_3
       :parameters (?v8 - type_1 ?v5 - object ?v1 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v5 ?v6) (pred_3 ?v8 ?v1))
       :effect (and (pred_2 ?v5 ?v1)
		    (pred_4 ?v8 ?v6)
		    (not (pred_1 ?v8 ?v5 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_09 - type_1
obj_07 obj_02 obj_05 obj_13 - type_3
obj_12 obj_01 obj_06 obj_08 - type_2
obj_03 obj_10 obj_04 - object)
(:init
(pred_3 obj_11 obj_01)
(pred_4 obj_11 obj_07)
(pred_4 obj_11 obj_02)
(pred_3 obj_09 obj_12)
(pred_4 obj_09 obj_05)
(pred_4 obj_09 obj_13)
(pred_2 obj_03 obj_08)
(pred_2 obj_10 obj_01)
(pred_2 obj_04 obj_06)
)
(:goal
(and
(pred_2 obj_03 obj_08)
(pred_2 obj_10 obj_01)
(pred_2 obj_04 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_11 obj_08) (pred_3 obj_09 obj_08))))
  )
)
)

; plan
1. (op_2 obj_11 obj_01 obj_12)
   deleted: (pred_3 obj_11 obj_01)
   added: (pred_3 obj_11 obj_12)
   goals met: 2 of 3
2. (op_2 obj_09 obj_12 obj_06)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_06)
   goals met: 2 of 3
3. (op_1 obj_09 obj_04 obj_06 obj_13)
   deleted: (pred_2 obj_04 obj_06) (pred_4 obj_09 obj_13)
   added: (pred_1 obj_09 obj_04 obj_13)
   goals met: 2 of 3
4. (op_2 obj_09 obj_06 obj_08)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_08)
   goals met: 2 of 3
5. (op_3 obj_09 obj_04 obj_08 obj_13)
   deleted: (pred_1 obj_09 obj_04 obj_13)
   added: (pred_2 obj_04 obj_08) (pred_4 obj_09 obj_13)
   goals met: 3 of 3
